export default function HomePage() {
  return (
    <main className="app-container">
      <h1>CodeArena</h1>
      <p>
        Учебное приложение для подготовки разработчиков к техническим
        собеседованиям с помощью Ai.
      </p>

      <div>
        <h2>Что умеет приложение</h2>
        <ul>
          <li>
            Тренировка разработчика перед собеседованием с помощью искусственного интелекта.
          </li>
          <li>
            Возможность провести онлайн-собеседование для двух людей в
            редакторе кода прямо на сайте.(в разработке)
          </li>
        </ul>
      </div>

      <div>
        <h2>Для кого это приложение</h2>
        <p>
          Платформа подойдёт начинающим и практикующим разработчикам, которые
          хотят отрабатывать свои навыки, решать задачи для практики перед собеседованиями. Проходить интервью в более
          реалистичном формате(в разработке).
        </p>
      </div>
    </main>
  );
}
